{
  "@bundle": {
    "name": "Most recent AFD anywhere (sample)"
  },
  "@context": {
    "@version": "1.1",
    "@vocab": "https://api.weather.gov/ontology#"
  },
  "@id": "https://api.weather.gov/products/2d75368e-4a94-4c22-b870-d09729478f00",
  "id": "2d75368e-4a94-4c22-b870-d09729478f00",
  "wmoCollectiveId": "FXUS62",
  "issuingOffice": "KTAE",
  "issuanceTime": "2024-08-06T18:51:00+00:00",
  "productCode": "AFD",
  "productName": "Area Forecast Discussion",
  "productText": "\n000\nFXUS62 KTAE 061851\nAFDTAE\n\nArea Forecast Discussion\nNational Weather Service Tallahassee FL\n251 PM EDT Tue Aug 6 2024\n\n...New NEAR TERM, SHORT TERM, LONG TERM, AVIATION, MARINE, FIRE WEATHER, HYDROLOGY...\n\n.NEAR TERM...\n(Through Wednesday)\nIssued at 240 PM EDT Tue Aug 6 2024\n\nUpper level ridging and subsidence from the proximity of Debby's \nremnants to the forecast area tomorrow will continue to lead to \npredominantly clear conditions across the forecast area. There will \na stark temperature gradient across the region, with SE Alabama and \nthe Florida Panhandle high temperatures approaching triple digits. \nHigher dewpoints in the mid 70s will slowly start to encroach back \ninto the region from the Gulf on Wednesday. This will be in response \nto coastal winds becoming more southwesterly in the afternoon as the \nseabreeze pushes inland along the coast. Given these high \ntemperatures and dewpoints along the coastal Panhandle areas, a Heat \nAdvisory has been issued for portions of Walton, Bay and Gulf \ncounties for Wednesday afternoon. This advisory could be expanded \nduring the overnight hours with future forecast updates. High \ntemperatures across SW Georgia and portions of the Florida Big Bend \nwill predominantly struggle to reach the low to mid 90s as some \ncloud cover may still be present from Debby. This will keep Advisory \nlevel heat out of this portion of the forecast area tomorrow. \nOverall, tomorrow will remain hot and dry for most across the \nregion. Lows tonight will drop into the mid 70s. \n\n&&\n\n.SHORT TERM AND LONG TERM...\n(Wednesday night through Monday) \nIssued at 240 PM EDT Tue Aug 6 2024\n\nA warming and drying trend is expected through this Thursday as \nnorth to northwesterly flow prevails, gradually bringing dew points \ndown and keeping PoPs low for inland areas. As we approach the \nweekend the sea breeze will attempt to push inland each day, \npossibly bringing our PoPs to a more seasonal norm across our FL and \nsouth GA counties. An approaching front this weekend will aid the \nsea breeze as a forcing mechanism to induce scattered to widespread \nshowers and storms. Several counties could see heat advisory \nconditions met along the FL Panhandle through Thursday. Once we get \ninto this weekend and beyond, the diurnal sea breeze is expected to \nkeep conditions below heat advisory levels.\n\nExpect daytime highs generally in the 90s with overnight lows \ngenerally in the mid to upper 70s.\n\n\n\n.AVIATION...\n(18Z TAFS)\nIssued at 240 PM EDT Tue Aug 6 2024\n\nVFR conditions look to remain at all terminals except VLD today\nthat is still experiencing off and on MVFR CIGs from the remnants\nof Debby. These restrictions at VLD should lift by the afternoon\nhours, but could return during the mid-morning hours on Wednesday.\nAll other terminals look to remain VFR with northerly to\nnorthwesterly winds at around 10-20 knots today. \n\n&&\n\n.MARINE...\nIssued at 240 PM EDT Tue Aug 6 2024\n\nA lingering tight pressure gradient in the wake of TS Debby \nmaintains breezy winds across the waters with advisory levels across \nour waters through tonight. Cautionary conditions then become more \nprominent tomorrow through Friday.\n\n&&\n\n.FIRE WEATHER...\nIssued at 240 PM EDT Tue Aug 6 2024\n\nHigh dispersions are expected across the entire forecast area on \nWednesday as transport winds look to remain elevated thanks to \nthe proximity of Debby's remnants to the area. This combined with \ndeep mixing heights approaching 7000 feet will lead to the high to \nvery high dispersions areawide. Rain chances will remain low across\nthe area, but high temperatures look to surge into the mid to upper 90s\nacross the forecast area. \n\n\n&&\n\n.HYDROLOGY...\nIssued at 240 PM EDT Tue Aug 6 2024\n\nAn overall drying trend is expected through Thursday before \nreverting more to a typical summertime seabreeze pattern of \ndiurnally driven thunderstorms. No additional significant rain is \nexpected outside of pop-up thunderstorms, where localized flooding \ncould occur.\n\nThe main hydrologic focus will be riverine flooding from Debby's \nrainfall. The St Marks River Newport, Aucilla River Lamont, and \nValdosta at Skipper Bridge are all forecast to reach minor flood \nstage. As such, the Flood Warnings for those sites continue. The \nSuwannee basin is expected to experience minor flooding later this \nweek. Meanwhile, the Ochlockonee River near Thomasville Flood \nWarning was cancelled yesterday evening in response to the newest \nforecast cresting in action stage.\n\n&&\n\n.SPOTTER INFORMATION STATEMENT...\n\nSpotter activation is not requested. However, spotters are always \nencouraged to safely report significant weather conditions when they \noccur by calling the office or tweeting us @NWSTallahassee.\n\n&&\n\n.PRELIMINARY POINT TEMPS/POPS...\nTallahassee   75  96  77  95 /   0  10   0  20 \nPanama City   80  97  80  95 /   0   0  10  10 \nDothan        75  99  77  97 /   0   0   0  10 \nAlbany        75  96  76  94 /  10  10   0  20 \nValdosta      74  93  75  92 /  20  20  10  30 \nCross City    77  93  78  92 /  10  20  20  40 \nApalachicola  80  95  82  93 /  10   0  10  30 \n\n&&\n\n.TAE WATCHES/WARNINGS/ADVISORIES...\nFL...Heat Advisory from 1 PM EDT /noon CDT/ to 8 PM EDT /7 PM CDT/ \n     Wednesday for FLZ012-014-108-112-114.\n\n     High Rip Current Risk until 2 AM EDT /1 AM CDT/ Wednesday for \n     FLZ112-114-115.\n\nGA...None.\nAL...None.\nGM...Small Craft Advisory until 8 PM EDT this evening for GMZ730-755-\n     765-775.\n\n&&\n\n$$\n\nNEAR TERM...Bunker\nSHORT TERM...Oliver\nLONG TERM....Oliver\nAVIATION...Bunker\nMARINE...Oliver\nFIRE WEATHER...Bunker\nHYDROLOGY...Oliver\n"
}
