{
  "@context": {
    "@version": "1.1",
    "@vocab": "https://api.weather.gov/ontology#"
  },
  "@id": "https://api.weather.gov/products/81724a6c-3b8f-4284-bd62-49d259b39697",
  "id": "81724a6c-3b8f-4284-bd62-49d259b39697",
  "wmoCollectiveId": "FXUS61",
  "issuingOffice": "KALY",
  "issuanceTime": "2024-09-05T11:29:00+00:00",
  "productCode": "AFD",
  "productName": "Area Forecast Discussion",
  "productText": "\n000\nFXUS61 KALY 051129\nAFDALY\n\nAREA FORECAST DISCUSSION\nNational Weather Service Albany NY\n729 AM EDT Thu Sep 5 2024\n\n.SYNOPSIS...\nHigh pressure will bring dry conditions through Friday. Skies \nwill be mostly clear, although some patchy low clouds and fog \nwill develop late tonight into Friday morning. A slow moving \nfrontal system tracking from west to east will bring a period of\nrain Saturday afternoon and night, followed by breezy and \nunseasonably cool temperatures for Sunday into early next week.\n\n&&\n\n.NEAR TERM /UNTIL 6 PM THIS EVENING/...\n.UPDATE...As of 630 AM EDT, patchy fog has developed within many\nriver valleys across the region, some of which was locally\ndense. This fog will dissipate between 8 and 10 AM.\n\nOtherwise, forecast on track. Temps have dropped into the\nlower/mid 40s across the southern Adirondacks, with mid 40s to\nlower/mid 50s elsewhere.\n\n[PREVIOUS 350 AM]...As of 345 AM EDT, skies remain clear \noutside of some patchy fog/low clouds forming immediately \nadjacent to some rivers/lakes. Temps have dropped into the \nlower/mid 40s across portions of the southern Adirondacks, with \nupper 40s to lower/mid 50s elsewhere.\n\nAny patchy fog should dissipate between 8-10 AM. Otherwise, \nanother sunny and warm day ahead, with afternoon high \ntemperatures reaching 75-80 for most valley areas and 70-75 \nacross higher elevations.\n\n&&\n\n.SHORT TERM /6 PM THIS EVENING THROUGH SATURDAY NIGHT/...\nGenerally clear skies this evening, followed by development of\nsome patchy low clouds/fog after midnight, especially for \nportions of the the Capital Region south and east. Slightly \nmilder tonight with more clouds around, with mainly 50s to \naround 60 for lows, although some mid/upper 40s will be possible\nacross the southern Adirondacks.\n\nMorning low clouds may linger through mid morning within some\nriver valleys from the Capital Region south and east, otherwise\nbecoming mostly sunny with afternoon temperatures reaching 75-80\nfor lower elevations, and 70-75 across higher terrain areas,\nwith coolest temps possibly across the higher elevations of the\nBerkshires due to a slightly cooler maritime airmass influence.\n\nMainly dry for Friday night despite increasing clouds. Milder\nwith lows mainly in the 50s to lower 60s.\n\nOccluded front approaches from the west Saturday. There could be\nsome breaks in the clouds during the morning hours from the\nHudson River Valley into western New England, otherwise becoming\ncloudy with a band of light to moderate rain advancing eastward\nduring the late morning through afternoon hours. Instability\nlooks meager at this time, so will keep out mention of thunder\nfor now. However, should enough sunshine occur before the\nfrontal rainband approaches, then slightly greater instability\nand possible thunderstorms might occur. Gusty south to southeast\nwinds up to 25 mph will be possible ahead of the front,\nespecially within the Hudson River Valley. Max temps may reach \nthe 70s ahead of the front from the Hudson River Valley east \ninto western New England, with mainly 60s to the west. Temps \nwill likely drop back through the 60s in the afternoon once rain\ndevelops, perhaps even into the 50s for some western areas.\n\nSome lingering showers Saturday evening, mainly across western\nNew England, otherwise becoming partly cloudy. Some Lake Effect\nrain showers may develop across portions of the Mohawk Valley\nand SW Adirondacks later at night. Turning cooler with lows in\nthe 40s to lower 50s.\n\n&&\n\n.LONG TERM /SUNDAY THROUGH WEDNESDAY/...\nUpper closed low will track just north of our region, along and just \nnorth of the U.S./Canada border, Sunday, lifting northeast Monday. \nUpper cold pool will track across northwestern and northern areas, \nand with some lake effect moisture, will result in some scattered \nshower activity into the southern Adirondacks. It will be cooler, \nwith a gusty west to northwest wind Sunday. Highs in the 60s to \naround 70 with mid 50s to around 60 higher terrain.\n\nUpper low continues to exit east and north and upper heights rise as \nflat upper ridging builds into our region Monday through Wednesday. \nDry weather and slowly warming temperatures are expected Monday \nthrough Wednesday. \n\nHighs Monday in the lower to mid 70s, with 60s in higher terrain. \nHighs Tuesday and Wednesday in the upper 70s to near 80 with around \n70 to lower 70s higher terrain.\n\n&&\n\n.AVIATION /12Z THURSDAY THROUGH MONDAY/...\nHigh pressure in control through tonight. Typical intervals of IFR \nconditions in fog at KGFL and KPSF through about 13Z, and mainly \nBCFG at KALB. The rest the day through this evening, few clouds if \nany with VFR conditions.  More fog may develop at KGFL and KPSF \ntonight.\n\nWinds will be nearly calm through mid morning. Winds become\nsouth at less than 10 Kt mid morning through this afternoon and\ndiminish this evening to near calm.\n\nOutlook...\n\nFriday Night: No Operational Impact. NO SIG WX.\nSaturday: High Operational Impact. Breezy. Likely SHRA.\nSaturday Night: Moderate Operational Impact. Chance of SHRA.\nSunday: No Operational Impact. NO SIG WX.\nSunday Night: No Operational Impact. NO SIG WX.\nMonday: No Operational Impact. NO SIG WX.\n\n&&\n\n.ALY WATCHES/WARNINGS/ADVISORIES...\nCT...None.\nNY...None.\nMA...None.\nVT...None.\n\n&&\n\n$$\n\nSYNOPSIS...KL/Rathbun\nNEAR TERM...KL\nSHORT TERM...KL\nLONG TERM...NAS\nAVIATION...NAS\n"
}
